app/Controllers/Buku.php

    public function peminjaman()
{
    $role = session()->get('role');
    $id_user = session()->get('id_users');

    $builder = $this->peminjamanModel
        ->select('peminjaman.*, buku.judul, users.nama as nama_peminjam') // Tambahkan nama peminjam
        ->join('buku', 'buku.id_buku = peminjaman.id_buku')
        ->join('users', 'users.id = peminjaman.id_anggota'); // Join ke tabel user

    // LOGIKA FILTER:
    // Jika bukan Admin dan bukan Petugas, maka hanya tampilkan miliknya sendiri
    if ($role !== 'admin' && $role !== 'petugas') {
        $builder->where('id_anggota', $id_user);
    }

    $data['pinjam'] = $builder->findAll();
---
SELECT `peminjaman`.*, `buku`.`judul`, `users`.`nama` as `nama_peminjam`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `users` ON `users`.`id` = `peminjaman`.`id_anggota`