app/Controllers/Buku.php

  public function index()
{
    $keyword = $this->request->getGet('keyword');

    $builder = $this->db->table('buku');
    $builder->select('
        buku.*,
        kategori.nama_kategori,
        penulis.nama_penulis,
        penerbit.nama_penerbit,
        rak.nama_rak,
        rak.lokasi
    ');

    $builder->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left');
    $builder->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left');
    $builder->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left');

    // ✅ INI YANG BENAR
    $builder->join('rak', 'rak.id_rak = buku.id_rak', 'left');

    if ($keyword) {
        $builder->like('buku.judul', $keyword);
    }

    $data['buku'] = $builder->get()->getResultArray();
---
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`, `rak`.`lokasi`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku`.`id_rak`

    public function detail($id)
    {
        $builder = $this->db->table('buku');
        $builder->select('
            buku.*,
            kategori.nama_kategori,
            penulis.nama_penulis,
            penerbit.nama_penerbit,
            rak.nama_rak,
            rak.lokasi
        ');
        $builder->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left');
        $builder->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left');
        $builder->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left');
        $builder->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left');
        $builder->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left');
        $builder->where('buku.id_buku', $id);

        $data['buku'] = $builder->get()->getRowArray();
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '21'


        $this->buku->update($id, $data);

        $this->db->table('buku_rak')
            ->where('id_buku', $id)
            ->update(['id_rak' => $data['id_rak']]);
---
UPDATE `buku_rak` SET `id_rak` = '2'
WHERE `id_buku` = '1'