app/Controllers/Buku.php

SELECT *
FROM `buku`
---
    public function index()
    {
        $data['buku'] = $this->bukuModel->findAll();

SELECT *
FROM `kategori`
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`
---
    public function create()
    {
        $kategoriModel = new KategoriModel();
        $penulisModel = new PenulisModel();
        $penerbitModel = new PenerbitModel();
        $rakModel = new RakModel();

        $data = [
            'kategori' => $kategoriModel->findAll(),
            'penulis'  => $penulisModel->findAll(),
            'penerbit' => $penerbitModel->findAll(),
            'rak'      => $rakModel->findAll(),
        ];

SELECT *
FROM `penerbit`
SELECT *
FROM `penulis`
SELECT *
FROM `kategori`
---
   public function edit($id)
{
    // Ambil data buku yang akan diedit
    $buku = $this->bukuModel->find($id);

    if (empty($buku)) {
        return redirect()->to('/buku')->with('error', 'Data tidak ditemukan');
    }

    // Load model pendukung
    $kategoriModel = new \App\Models\KategoriModel();
    $penulisModel  = new \App\Models\PenulisModel();
    $penerbitModel = new \App\Models\PenerbitModel();
    $rakModel      = new \App\Models\RakModel();

    $data = [
        'buku'       => $buku,
        'kategori'   => $kategoriModel->findAll(),
        'penulis'     => $penulisModel->findAll(), // Kita beri nama 'penulis'
        'penerbit'   => $penerbitModel->findAll(),
        'rak'        => $rakModel->findAll(),
    ];

UPDATE `buku` SET `judul` = 'Doraemon', `isbn` = '1123', `id_kategori` = '1', `id_penulis` = '1', `id_penerbit` = '0', `id_rak` = '1', `tahun_terbit` = '2001', `jumlah` = '10', `tersedia` = '5', `deskripsi` = 'hidup mas joko', `cover` = '1776799226_cf302a03e81c59843f65.jpeg'
WHERE `buku`.`id_buku` IN ('8')
---
    public function update($id)
    {
        $fileCover = $this->request->getFile('cover');

        if ($fileCover && $fileCover->isValid() && !$fileCover->hasMoved()) {
            $namaCover = $fileCover->getRandomName();
            $fileCover->move('uploads/buku/', $namaCover);


        }

        $data = [
            'judul'        => $this->request->getPost('judul'),
            'isbn'         => $this->request->getPost('isbn'),
            'id_kategori'  => $this->request->getPost('id_kategori'),
            'id_penulis'   => $this->request->getPost('id_penulis'),
            'id_penerbit'  => $this->request->getPost('id_penerbit'),
            'id_rak'       => $this->request->getPost('id_rak'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
            'jumlah'       => $this->request->getPost('jumlah'),
            'tersedia'     => $this->request->getPost('tersedia'),
            'deskripsi'    => $this->request->getPost('deskripsi'),
            'cover'        => $namaCover
        ];

        $this->bukuModel->update($id, $data);

SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '7'
UPDATE `buku` SET `judul` = 'Doraemon', `isbn` = '11232', `tahun_terbit` = '0000', `jumlah` = '21', `tersedia` = '2', `deskripsi` = '212'
WHERE `buku`.`id_buku` IN ('1')
---
    public function pinjam($id_buku)
    {
        $buku = $this->bukuModel->find($id_buku);

        if ($buku['tersedia'] <= 0) {
            return redirect()->back()->with('error', 'Stok buku habis!');
        }

        $this->peminjamanModel->save([
            'id_buku'         => $id_buku,
            'id_anggota'      => session()->get('id_users'),
            'id_petugas'      => session()->get('id_users'), // Sementara disamakan
            'tanggal_pinjam'  => date('Y-m-d'),
            'tanggal_kembali' => date('Y-m-d', strtotime('+7 days')),
            'status'          => 'dipinjam',
            'denda'           => 0
        ]);

        $this->bukuModel->update($id_buku, ['tersedia' => $buku['tersedia'] - 1]);

SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '6'
UPDATE `buku` SET `tersedia` = 1
WHERE `buku`.`id_buku` IN ('6')
---
    public function kembalikan($id_peminjaman)
    {
        $pinjam = $this->peminjamanModel->find($id_peminjaman);
        if (!$pinjam) return redirect()->back();

        $tgl_kembali_seharusnya = new \DateTime($pinjam['tanggal_kembali']);
        $tgl_sekarang = new \DateTime(date('Y-m-d'));
        $denda = 0;

        if ($tgl_sekarang > $tgl_kembali_seharusnya) {
            $selisih = $tgl_sekarang->diff($tgl_kembali_seharusnya);
            $denda = $selisih->days * 1000;
        }

        $this->peminjamanModel->update($id_peminjaman, [
            'tanggal_dikembalikan' => date('Y-m-d'),
            'status'               => 'kembali',
            'denda'                => $denda
        ]);

        $buku = $this->bukuModel->find($pinjam['id_buku']);
        $this->bukuModel->update($pinjam['id_buku'], ['tersedia' => $buku['tersedia'] + 1]);

SELECT `peminjaman`.*, `buku`.`judul`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
WHERE `id_anggota` IS NULL
---
    public function peminjaman()
    {
        $data['pinjam'] = $this->peminjamanModel
            ->select('peminjaman.*, buku.judul')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->where('id_anggota', session()->get('id_users'))
            ->findAll();