app/Controllers/Peminjaman.php

    public function index()
    {
        $peminjaman = $this->peminjamanModel->select('peminjaman.*, buku.judul, users.nama')
            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
            ->join('users', 'users.id = peminjaman.id_anggota')
            ->findAll();
---
SELECT `peminjaman`.*, `buku`.`judul`, `buku`.`cover`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
WHERE `id_anggota` = '8'
ORDER BY `id_peminjaman` DESC