app/Controllers/Users.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        if ($keyword) {
            $this->users->like('nama', $keyword)->orLike('username', $keyword);
        }

        $data['users'] = $this->users->paginate(10, 'users');

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function edit($id)
    {
        $data['user'] = $this->users->find($id);