app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `users`.`id` = '8'
---
public function profile()
{
    // Sekarang sudah sinkron menggunakan 'id_users'
    $id = session()->get('id_users');

    if (!$id) {
        return redirect()->to('/login')->with('error', 'Silakan login ulang.');
    }

    $user = $this->users->find($id);