app/Models/UsersModel.php

    public function getUsersByUsername($username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'paes'
 LIMIT 1